#include "Object.h"

GLfloat Object::CoordinateVertexs[12] = {
    1.0f, 0.0f, 0.0f,
    -1.0f, 0.0f, 0.0f,
    0.0f, -1.0f, 0.0f,
    0.0f, 1.0f, 0.0f
};

GLfloat Object::CoordinateColors[12] = {
		0.0f, 1.f, 0.f,
		0.0f, 1.f, 0.f,
		1.0f, 0.f, 0.f,
		1.0f, 0.f, 0.f
};

GLfloat Object::CubeVertexs[24] = {
			-0.5f, 0.5f, -0.5f,  //0번점
			-0.5f, 0.5f, 0.5f,  //1번점
			0.5f, 0.5f, 0.5f,  //2번점
			0.5f, 0.5f, -0.5f,  //3번점

			-0.5f, -0.5f, -0.5f,  //4번점
			-0.5f, -0.5f, 0.5f,  //5번점
			0.5f, -0.5f, 0.5f,  //6번점
			0.5f, -0.5f, -0.5f,  //7번점
};

GLfloat Object::CubeColors[24] = {
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //0번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //1번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //2번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //3번점

			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //4번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //5번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //6번점
			135.f / 255.f,206.f / 255.f,235.f / 255.f,  //7번점
};

GLint Object::CubeIndexs[36] =
{
	0,1,2,
	0,2,3,  //윗면

	1,5,6,
	1,6,2, //앞면

	2,6,7,
	2,7,3, //우측면

	0,4,5,
	0,5,1, //좌측면

	5,4,6,
	4,7,6,// 밑면

	0,7,4, //뒷면
	0,3,7
};